/* 
События мышки
===================================================================================================================================
click – происходит, когда кликнули на элемент левой кнопкой мыши (на устройствах с сенсорными экранами оно происходит при касании).
contextmenu – происходит, когда кликнули на элемент правой кнопкой мыши.
mouseover / mouseout – когда мышь наводится на / покидает элемент.
mousedown / mouseup – когда нажали / отжали кнопку мыши на элементе.
mousemove – при движении мыши.

События на элементах управления:
===================================================================================================================================
submit – пользователь отправил форму <form>.
focus – пользователь фокусируется на элементе, например нажимает на <input>.

Клавиатурные события
===================================================================================================================================
keydown и keyup – когда пользователь нажимает / отпускает клавишу.

События документа
===================================================================================================================================
DOMContentLoaded – когда HTML загружен и обработан, DOM документа полностью построен и доступен.

CSS events:
===================================================================================================================================
transitionend – когда CSS-анимация завершена.
*/

// использование атрибутов HTML
// <input value="Нажми меня" onclick="alert('Клик!')" type="button">

// Использование свойства DOM-объекта
// Добавить обработчик событий
let elem = document.getElementsByName("id");
elem.onclick = () => elem.style.backgroundColor = "gray"; // При клике меняет фон элемента на серый

// Несколько оброботчиков событий
elem.addEventListener("onevent", handler);
elem.addEventListener("onevent", handler2);

// Удаление обработчиков событий
elem.removeEventListener("onevent", handler);

// Объект события
elem.onclick = (event) => {
    alert(event.type); // Выводит тип события

    // Коордианат курсора в момент клика относительно окна, для событий мыши
    event.clientX;
    event.clientY;
    event.target;
}

// Прекращение всплытия
elem.onclick = (event) => {
    alert("Событие обработано")
    event.stopPropagation();
}