let billion = 1e9;      // bilion = 1.000.000.000
let ms = 1e-6;          // ms = 0.000001
let hex = 0xff;         // hex = 255 | Шестнадцатиричная
let bin = 0b11111111;   // bin = 255 | Двоичная
let oct = 0o377;        // oct = 255 | Восьмиричная


// Конвертация
// =================================================================
let num = 255;
numToStringTen = num.toString(10);  // Конвертаниця в строку "255"
numToStringBin = num.toString(2);   // Конвертаниця в строку "11111111"
numToStringOct = num.toString(8);   // Конвертаниця в строку "377"
numToStringHex = num.toString(16);  // Конвертаниця в строку "ff"

parseInt("100px") // 100
parseFloat("12.3em") // 12.3
parseInt("12.3") // 12
parseFloat("12.3.3") // 12.3
parseInt("a123") // NaN
// =================================================================


// Округления
// ======================================================================
let floor = Math.floor(3.6);            // 3     | Уменьшает
let ceil = Math.ceil(3.1);              // 4     | Увеличивает
let round = Math.round(3.55);           // 4     | Округляет
let round2 = Math.round(3.45);          // 3     | Округляет
let trunc = Math.trunc(3.33);           // 3     | Удаляет дробную часть
let fix = Number(1.2345).toFixed(2);    // 10.12 | Обрезает дробную часть
// ======================================================================

// isFinet и isNaN
// =========================================================================
// isNaN перобразует аргумент в число и если получается, то возвращает false
isNaN(NaN);     // true
isNaN("str");   // true
isNaN("100");   // false
isNaN(100);     // false

// isFinet преобразует аргумент в число и возвращает true
isFinite("15");     // true
isFinite("str")     // false
isFinite(Infinity)  // false
// =========================================================================

// Мат. Функции
// ==============================================================
Math.random()       // 0-1 | Генерация случайного числа от 0 до 1
Math.max(7, 3, 9)   // 9   | Возвращает большее число
Math.pow(2, 4)      // 16  | Возведение в степень
// ==============================================================